inherit ROOM;
void create()
{
    set("short", "棉花坊");
    set("long","每当天气渐冷，风云老少都会到这儿来将自己的冬衫，冬被弹一弹，这里的老\n"
"板娘更擅长补衣服，补出来的衣服不但牢固，而且总是恰到好处地绣朵花，打个褶\n"
"儿什么的，一点儿也看不出补过的痕迹。墙上贴着一张收费告示（sign）。\n"
);
    set("exits", ([ /* sizeof() == 4 */
	"west" : __DIR__"huanyun5",
      ]));
    set("objects", ([
	__DIR__"npc/mianhua" : 1,
      ]) );
    set("item_desc", ([
	"sign": "\n"
"[0;1;37m────────────────────────────────[0m\n"
"[0;1;36m		棉花坊收费，老少无欺[0m\n"
"[0;1;37m────────────────────────────────[0m\n"
"\n"
"修补衣物（ｂｕ）： 每点一两黄金。\n"
"\n"
"[0;1;37m────────────────────────────────[0m\n"
""
      ]) );
    set("coor/x",80);
    set("coor/y",-160);
    set("coor/z",0);
    set("map","fysouth");
    setup();
    replace_program(ROOM);
}

/*
（1）修补衣物（ｂｕ）：
* 自制衣物每点二两黄金．
* 防护力20以下统收一两黄金，20以上每点五两黄金。

（2）加织自制衣物（ｚｈｉ）：价格面议

*/